## DataFrame Data Type Basics

In [8]:
#DataFrame are type objects.
#DataFrame are 2Dimensional-Just a Collection of many Series.

import pandas as pd

df=pd.DataFrame()

print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [6]:
#Creating Data Frame from Python Dictionary Data Structure

import pandas as pd
city_data = {
    "City": ["New York City", "Paris", "Barcelona", "Rome"],
    
    "Country": ["United States", "France", "Spain", "Italy"],
    
    "Population": pd.Series([8600000, 2141000, 5515000, 2873000])
}

cities = pd.DataFrame(city_data)
cities

            City        Country  Population
0  New York City  United States     8600000
1          Paris         France     2141000
2      Barcelona          Spain     5515000
3           Rome          Italy     2873000

In [9]:
# transposing 

cities.transpose()

                        0        1          2        3
City        New York City    Paris  Barcelona     Rome
Country     United States   France      Spain    Italy
Population        8600000  2141000    5515000  2873000

In [11]:
#Creating an empty Dataframe

row_labels = ["Morning", "Afternoon", "Evening"]

column_labels = (
    "Monday", "Tuesday", "Wednesday", "Thursday", "Friday")
pd.DataFrame(
 
    index = row_labels,
    columns = column_labels,
)

          Monday Tuesday Wednesday Thursday Friday
Morning      NaN     NaN       NaN      NaN    NaN
Afternoon    NaN     NaN       NaN      NaN    NaN
Evening      NaN     NaN       NaN      NaN    NaN